artillery/perfo_test.yml
config:
  target: https://cat-fact.herokuapp.com/#/cat/facts/
  phases:
    - duration: 2
      arrivalRate: 2
      name: Artillery Performance Test
  payload:
    - path: "keywords_perfo.csv"
      fields:
        - "keyword1"
        - "keyword2"
      order: sequence
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 500
      - http.response_time.p99: 1000
      - http.response_time.max: 700
      - http.response_time.min: 200
      - http.responses: 10
      - vusers.session_length.min: 700
      - vusers.session_length.max: 2000
    conditions:
      - expression: http.request_rate >= 2 and http.response_time.min < 600
      - expression: http.request_rate >= 2 and http.response_time.max < 1000
      - expression: vusers.failed==0
  statuscode: 200
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get?param1={{ **keyword1** }}"
      - post:
          url: "{{ target }}post?param2={{ **keyword2** }}"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
      - log: "Request body: {{request_body}}"
      - log: "Host value from response is: {{host}}"