artillery/perfo_test.yml
config:
  target: https://postman-echo.com/
  phases:
    - duration: 20
      arrivalRate: 4
      name: Artillery Performance Test
  payload:
    - path: "keywords_perfo.csv"
      fields:
        - "userkey1"
        - "userkey2"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: vusers.failed == 0
      - expression: vusers.created > 70
      - expression: vusers.created_by_name.Getting a resource == 80
      - expression: "http.request_rate >= 2"
      - expression: "http.response_time.min < 200"
      - expression: "http.response_time.max < 1000"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target}}get"
      - post:
          url: "{{ target}}post"
          json:
            username: "{{ userkey1 }}"
            password: "{{ userkey2 }}"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.host"
              as: "host"
      - log: "Json value from response is: {{ request_body }}"
      - log: "Host value from response is: {{ host }}"
      - log: "Userkey1: {{ userkey1 }}"
      - log: "Userkey2: {{ userkey2 }}"